app/controllers/pins_controller.rb

  def index
    @pins = Pin.all.order("created_at DESC")
---
SELECT "pins".* FROM "pins" ORDER BY created_at DESC

  def create
    @pin = current_user.pins.build(pin_params)

    if @pin.save
---
INSERT INTO "pins" ("title", "description", "created_at", "updated_at", "user_id", "image_file_name", "image_content_type", "image_file_size", "image_updated_at") VALUES (?, ?, ?, ?, ?, ?, ?, ?, ?)

  def update
    if @pin.update(pin_params)
---
UPDATE "pins" SET "title" = ?, "image_file_name" = ?, "image_content_type" = ?, "image_file_size" = ?, "image_updated_at" = ?, "updated_at" = ? WHERE "pins"."id" = ?